[
    {
        "title": "First covid-19 death linked to Sturgis Motorcycle Rally reported in Minnesota - The Washington Post",
        "description": "The case, involving a biker in his 60s, is one of at least 260  infections traced back to the South Dakota event last month where many declined to wear masks.",
        "url": "https://www.washingtonpost.com/health/2020/09/02/sturgis-rally-death-coronavirus/"
    },
    {
        "title": "West Nile virus detected in New Hampshire for first time this season, health officials say - WMUR Manchester",
        "description": "Mosquito-borne West Nile virus has been detected in New Hampshire for the first time this season, health officials announced Wednesday.",
        "url": "https://www.wmur.com/article/west-nile-virus-new-hampshire-2020/33897322"
    },
    {
        "title": "The stock market thinks Joe Biden is going to beat Donald Trump - CNN",
        "description": "The presidential election is only two months away and the stock market is soaring.",
        "url": "https://www.cnn.com/2020/09/02/investing/joe-biden-stock-market-donald-trump/index.html"
    },
    {
        "title": "Intel announces its new 11th Gen Tiger Lake CPUs, available on laptops this fall - The Verge",
        "description": "Intel has announced it’s latest 11th Gen processors",
        "url": "https://www.theverge.com/2020/9/2/21408718/intel-11th-gen-tiger-lake-cpu-processor-announcement-laptops-fall"
    },
    {
        "title": "Chris Thompson: Jaguars running backs thought Leonard Fournette was joking when he said he’d been cut - NBC Sports - NFL",
        "description": "Monday’s news that the Jaguars had released running back Leonard Fournette surprised plenty of people. Those surprised included the other running backs in Jacksonville. Jaguars running back Chris Thompson, appearing Wednesday on SiriusXM NFL Radio, explained …",
        "url": "https://profootballtalk.nbcsports.com/2020/09/02/chris-thompson-jaguars-running-backs-thought-leonard-fournette-was-joking-when-he-said-hed-been-cut/"
    },
    {
        "title": "United Airlines will furlough 16,000 employees - CNN",
        "description": "With no air travel rebound or new federal help in sight, United Airlines says it will furlough about 20% of its frontline employees in less than a month's time.",
        "url": "https://www.cnn.com/2020/09/02/investing/united-airlines-furloughs/index.html"
    },
    {
        "title": "Novichok Nerve Agent Used To Poison Alexei Navalny, Germany Says - NPR",
        "description": "Novichok is the same nerve agent used in a 2018 attack in Britain on former KGB spy Sergei Skripal and his daughter, Yulia. A German government spokesman says the evidence is without a doubt.",
        "url": "https://www.npr.org/2020/09/02/908753772/alexei-navalny-was-poisoned-with-novichok-nerve-agent-germany-says"
    },
    {
        "title": "Rays manager Kevin Cash hints at retaliation after Yankees' Aroldis Chapman nearly hits batter in head - CBS Sports",
        "description": "Things got tense between the two teams in the Bronx on Tuesday night",
        "url": "https://www.cbssports.com/mlb/news/rays-manager-kevin-cash-hints-at-retaliation-after-yankees-aroldis-chapman-nearly-hits-batter-in-head/"
    },
    {
        "title": "Samsung unveils Galaxy A42 5G phone, Tab A7 and Trio wireless charging station - CNET",
        "description": "New devices announced at Samsung's virtual Life Unstoppable event.",
        "url": "https://www.cnet.com/news/samsung-life-unstoppable-announced-galaxy-a42-tab-a7-trio-wireless-charging-station-virtual-event/"
    },
    {
        "title": "Macy's CEO sees huge opportunity in luxury retail as other chains go bankrupt - CNBC",
        "description": "Look at luxury right now, look at Neiman's, look at parts of Lord & Taylor, Macy's Chief Executive Jeff Gennette told CNBC. There is opportunity for us. Nordstrom is closing stores.",
        "url": "https://www.cnbc.com/2020/09/02/macys-ceo-sees-opportunity-in-luxury-retail-as-others-go-bankrupt.html"
    },
    {
        "title": "Prince Harry and Meghan Sign Megawatt Netflix Deal - The New York Times",
        "description": "Six months after ceasing to be working members of the British royal family, the Duke and Duchess of Sussex are Hollywood producers.",
        "url": "https://www.nytimes.com/2020/09/02/business/media/harry-meghan-netflix.html"
    },
    {
        "title": "Satirical paper Charlie Hebdo reruns Muhammad cartoons as 14 go on trial for Paris attacks - CBS News",
        "description": "As the alleged accomplices to the gunmen face a series of charges, Charlie Hebdo's defiant director vows to never give up.",
        "url": "https://www.cbsnews.com/news/charlie-hebdo-reruns-muhammad-cartoon-trial-paris-attacks/"
    },
    {
        "title": "South and North Korea brace for two typhoons within a week - CNN",
        "description": "Two powerful typhoons are hurtling toward the Korean Peninsula, threatening to bring more flooding and devastation to an area that has already been battered by one of the wettest monsoon seasons in recent history.",
        "url": "https://www.cnn.com/2020/09/02/asia/typhoon-maysak-korea-intl-hnk/index.html"
    },
    {
        "title": "Maine CDC reports 1 new coronavirus-related death, 19 new cases - WMTW Portland",
        "description": "The Maine Center for Disease Control and Prevention reported one new coronavirus-related death and 19 additional cases on Wednesday.",
        "url": "https://www.wmtw.com/article/maine-cdc-reports-1-new-coronavirus-related-death-19-new-cases/33892892"
    },
    {
        "title": "Disney Grapples With How to Proceed on 'Black Panther' Without Chadwick Boseman - Hollywood Reporter",
        "description": "Outside of family, only a small group of insiders was aware of the Marvel star’s battle with cancer, and now studio executives are grieving and figuring out a way forward.",
        "url": "https://www.hollywoodreporter.com/news/disney-grapples-with-how-to-proceed-on-black-panther-without-chadwick-boseman"
    },
    {
        "title": "Black holes: Cosmic signal rattles Earth after 7 billion years - BBC News",
        "description": "Gravitational waves arrive from a black hole collision that occurred half-way across the Universe.",
        "url": "https://www.bbc.com/news/science-environment-53993937"
    },
    {
        "title": "'Dancing with the Stars' Season 29 celebrity cast includes Chrishell Stause, Carole Baskin, Nev Schulman - Fox News",
        "description": "The celebrity lineup for Dancing with the Stars Season 29 was announced Wednesday and it features quite the mix of entertainers.",
        "url": "https://www.foxnews.com/entertainment/dancing-with-the-stars-season-29-celebrity-cast-includes-chrishell-stause-carole-baskin"
    }
]